/*******************************************************************
* Файл: crypt_gost_28147-89_API.h								   *
* Описание:содержит обяъявление функций							   *
* криптографического алгоритма ГОСТ 28147-89					   *
* Автор: Иванов Роман Витальевич (c)							   *
* Год: 2014 - 2015												   *
*																   *
********************************************************************/

#ifndef CRYPT_GOST_28147_89_API_H_
#define CRYPT_GOST_28147_89_API_H_
#define CRYPT_GOST_API __declspec(dllexport)

#define CRYPT_GOST_28147_89_API_VERSION 0x01
/*******************************************************************
* crypt_gost_28147-89 version (версия dll)						   *
********************************************************************/
#if _DEBUG
#define DEBUG_INFO_PRINT 1
#else
#define DEBUG_INFO_PRINT 0
#endif
/*******************************************************************
* вывод на консоль отладочной информации						   *
********************************************************************/

#include "crypt_gost_types.h"

/*******************************************************************
* блок подстановки K состоит из 8 узлов замены k1, k2, k3, k4, k5, *
* k6, k7, k8 по 64 бит каждый 									   *
********************************************************************/


static byte k87[key_size256];
static byte k65[key_size256];
static byte k43[key_size256];
static byte k21[key_size256];

/*******************************************************************
* API functions (интерфейсные функции)							   *
********************************************************************/

/*******************************************************************
* Функция key_box_init() инициализирует ключ шифрования			   *
********************************************************************/
CRYPT_GOST_API void key_box_init(void);
/*******************************************************************
* Функция gostcrypt() шифрует 64 бита информации                   *
*			в режиме простой замены								   *
*  Параметры функции:											   *
*  1. {word32 const *in_data} массив из 2 элементов по 32 бит,	   *
*  входные данные для шифрования								   *
*																   *
*  2. {word32 *out_data} массив из 2 элементов по 32 бит           *
*  для зашифрованных данных										   *
*																   *
*  3. {word32 const *gost_key} - массив из 8 элементов типа word32 *
*	  (ключ шифорвания)											   *
*																   *
********************************************************************/
CRYPT_GOST_API void  gostcrypt( word32 const *in_data, word32 *out_data, word32 const *gost_key);
/*******************************************************************
* Функция gostdecrypt() расшифрует 64 бита информации              *
*			в режиме простой замены								   *
*  Параметры функции:											   *
*  1. {word32 const *in_data} массив из 2 элементов по 32 бит,	   *
*  входные данные для расшифрования								   *
*																   *
*  2. {word32 *out_data} массив из 2 элементов по 32 бит           *
*  для расшифрованных данных									   *
*																   *
*  3. {word32 const *gost_key} - массив из 8 элементов типа word32 *
*	  (ключ расшифрования)										   *
*																   *
********************************************************************/
CRYPT_GOST_API void gostdecrypt(word32 const *in_data, word32 *out_data, word32 const *gost_key);

/*******************************************************************
* private functions (вспомогательные функйии)					   *
********************************************************************/

static word32 f(word32 x);

#endif