/*******************************************************************
* Файл: has_p_34_11_2012.h										   *
* Описание:содержит обяъявление функций							   *
* для вычисления хэш функции по алгоритму ГОСТ P 34.11.2012		   *
* Автор: Иванов Роман Витальевич (c)							   *
* Год: 2015														   *
*																   *
********************************************************************/

#ifndef _HASH_P_34_11_2012_H_
#define _HASH_P_34_11_2012_H_

#if _DEBUG
#define PRINT_DEBUG_INFO 1
#else
#define PRINT_DEBUG_INFO 0
#endif

#define GOST_HASH_API __declspec(dllexport)
#include"crypt_gost_types.h"

/*******************************************************************
* API functions (интерфейсные функции)							   *
********************************************************************/

/*******************************************************************
* Функция hash_512() выяисляет хэш-функцию размером 512 бит		   *
*																   *
*  Параметры функции:											   *
*  1. {const byte *message} - массив данных, для которого		   *
*  вычисляется хэш												   *
*																   *
*  2. {word64 *length} - длина переданного массива				   *
*  для вычисления хэш											   *
*																   *
*  3. {byte *hash} - массив из 64 элементов для результата		   *
*																   *
********************************************************************/

GOST_HASH_API void hash_512(const byte *message, word64 length, byte *hash);


/*******************************************************************
* Функция hash_256() выяисляет хэш-функцию размером 256 бит		   *
*																   *
*  Параметры функции:											   *
*  1. {const byte *message} - массив данных, для которого		   *
*  вычисляется хэш												   *
*																   *
*  2. {word64 *length} - длина переданного массива				   *
*  для вычисления хэш											   *
*																   *
*  3. {byte *hash} - массив из 32 элементов для результата		   *
*																   *
********************************************************************/
GOST_HASH_API void hash_256(const byte *message, word64 length, byte *hash);

#endif